const dataUk =
{
  playerData: {
    teen: {
      health: [
        {prob:1,value:['Здоровий']},
        {prob:1, value: []},
      ],
      profession: [
        {prob:2,value:['Безробітний']},
        {prob:1, value: []}
      ]
    },

    young: {
      health: [
        {prob:1,value:['Здоровий']},
        {prob:2, value: []},
      ],
      profession: [
        {prob:1,value:['Безробітний']},
        {prob:5, value: []}
      ]
    },

    adult: {
      health: [
        {prob:1,value:['Здоровий']},
        {prob:4, value: []},
      ],
      profession: [
        {prob:1,value:['Безробітний']},
        {prob:6, value: []}
      ]
    },

    senior: {
      health: [
        {prob:1,value:['Здоровий']},
        {prob:4, value: []},
      ],
      profession: [
        {prob:1,value:['Безробітний']},
        {prob:5, value: []}
      ],
    },

    old: {
      health: [
        {prob:1,value:['Здоровий']},
        {prob:4, value: []},
      ],
      profession: [
        {prob:1,value:['Безробітний']},
        {prob:5, value: []}
      ]
    },

    bio: {
      nameMale: [
        'Джеймс', 'Джон', 'Роберт', 'Майкл', 'Вільям', 'Девід', 'Річард', 'Джозеф', 'Чарльз', 'Томас', 'Деніел', 'Меттью', 'Ентоні', 'Марк', 'Дональд', 'Стівен', 'Пол', 'Ендрю', 'Джошуа', 'Кеннет', 'Джордж', 'Едвард', 'Браян', 'Рональд', 'Самуель', 'Генрі', 'Нейтан', 'Френк', 'Джастін', 'Реймонд', 'Джек', 'Денніс', 'Джеррі', 'Олександр', 'Патрік', 'Тайлер', 'Аарон', 'Хосе', 'Генрі', 'Дуглас', 'Пітер', 'Адам', 'Закарі', 'Волтер', 'Ітан', 'Карл', 'Артур', 'Кайл', 'Дерек', 'Джордан', 'Сет', 'Крістіан', 'Роджер', 'Джонатон', 'Віллі', 'Алан', 'Вейн', 'Ральф', 'Рой', 'Луїс', 'Біллі', 'Джонні', 'Стенлі', 'Леонард', 'Фред', 'Гленн', 'Говард', 'Мартін', 'Філіп', 'Норман', 'Юджин', 'Ларрі', 'Террі', 'Герман', 'Крейг', 'Дейл', 'Джин', 'Карлос', 'Лоуренс', 'Джим', 'Ренді', 'Денні', 'Джессі', 'Джо', 'Кертіс', 'Віктор', 'Родні', 'Гордон', 'Леон', 'Моріс', 'Альберт', 'Клайд', 'Лерой', 'Мелвін', 'Глен', 'Едді', 'Кларенс', 'Джейк', 'Воррен', 'Джеральд', 'Едвін', 'Фредрік', 'Рей', 'Г\'ю',
      ],
      nameFemale: [     
        'Марія', 'Патриція', 'Дженніфер', 'Лінда', 'Єлизавета', 'Барбара', 'Сьюзан', 'Джессіка', 'Сара', 'Карен', 'Ненсі', 'Маргарита', 'Бетті', 'Сандра', 'Донна', 'Кароліна', 'Рут', 'Шерон', 'Мішель', 'Лаура', 'Сара', 'Кімберлі', 'Анжела', 'Меліса', 'Дебора', 'Стефанія', 'Ребекка', 'Лаура', 'Ширлі', 'Синтія', 'Катерина', 'Джоан', 'Аліса', 'Юдіт', 'Роза', 'Жанет', 'Тереза', 'Глорія', 'Евелін', 'Анна', 'Дебра', 'Доріс', 'Жанна', 'Шеріл', 'Мілдред', 'Катерина', 'Джуді', 'Ешлі', 'Донна', 'Таммі', 'Трейсі', 'Крістал', 'Тіна', 'Бренда', 'Беверлі', 'Марилін', 'Даніела', 'Діана', 'Софія', 'Джулі', 'Грейс', 'Жасмін', 'Олівія', 'Лорі', 'Рене', 'Андреа', 'Сара', 'Меган', 'Елеонора', 'Ганна', 'Лілія', 'Гедер', 'Саманта', 'Дженна', 'Джилл', 'Діана', 'Паула', 'Робін', 'Гедер', 'Лідія', 'Саллі', 'Джина', 'Ріта', 'Венді', 'Марта', 'Розмарі', 'Сьюзан', 'Єва', 'Юлія', 'Полетта', 'Жаннель', 'Мелані', 'Сільвія', 'Шарлін', 'Кассандра',
      ],
      surname: [ 
        'Сміт', 'Джонсон', 'Вільямс', 'Браун', 'Міллер', 'Вілсон', 'Мур', 'Андерсон', 'Джексон', 'Вайт', 'Гарріс', 'Мартін', 'Гарсія', 'Мартінез', 'Робінсон', 'Кларк', 'Родрігес', 'Льюїс', 'Лі', 'Вокер', 'Голл', 'Аллен', 'Янг', 'Гернандес', 'Кінг', 'Райт', 'Лопес', 'Гілл', 'Скотт', 'Грін', 'Адамс', 'Бейкер', 'Нельсон', 'Картер', 'Мітчелл', 'Перес', 'Робертс', 'Тернер', 'Філліпс', 'Кемпбелл', 'Паркер', 'Еванс', 'Едвардс', 'Коллінс', 'Стюарт', 'Санчес', 'Морріс', 'Роджерс', 'Рід', 'Кук', 'Морган', 'Белл', 'Мерфі', 'Бейлі', 'Рівера', 'Купер', 'Річардсон', 'Кокс', 'Говард', 'Ворд', 'Торрес', 'Пітерсон', 'Грей', 'Рамірес', 'Джеймс', 'Ватсон', 'Брукс', 'Келлі', 'Сандерс', 'Прайс', 'Беннетт', 'Вуд', 'Барнс', 'Росс', 'Г\'юз', 'Фостер', 'Фішер', 'Веллс', 'Воткінс', 'Олсон', 'Стоун', 'Вебб', 'Такер', 'Кертіс',
      ],
      sex: [
        'Чоловік', 'Жінка',
      ],
    },

    age: [
      { start: 13, end: 18, prob: 1, value: 'teen' },
      { start: 18, end: 25, prob: 2, value: 'young' },
      { start: 25, end: 40, prob: 4, value: 'adult' },
      { start: 40, end: 60, prob: 2, value: 'seniour' },
      { start: 60, end: 90, prob: 1, value: 'old' },
    ],

    health: [
      {prob:5, type: -3, name: 'Акне', stage: [
        {prob: 6, level: 'легке', value: 'Акне легкої важкості', description: 'Невеликі прищі, що з\'являються на шкірі.'},
        {prob: 3, level: 'легке', value: 'Акне середньої важкості', description: 'Помітні вугрі з частковим запаленням шкіри.'},
        {prob: 1, level: 'легке-середнє', value: 'Акне важкого ступеню', description: 'Численні папули(запальні прищі) та пустули (гнійники), виникають вузли — більші та глибші утворення на шкірі, рубці після загоєння'},
      ]},  
      {prob:1, type: 0, name: 'Втрата кінцівки', stage: [
        {prob: 9, level: 'середнє-важке', value: 'Втрата руки', description: 'Відсутність однієї руки, частково обмежена рухливість.'},
        {prob: 9, level: 'середнє-важке', value: 'Втрата ноги', description: 'Відсутність однієї ноги, ускладнення при ходьбі.'}, 
        {prob: 3, level: 'важке', value: 'Втрата обох рук', description: 'Відсутність обох рук, повна залежність від сторонньої допомоги.'},
        {prob: 3, level: 'важке', value: 'Втрата обох ніг', description: 'Відсутність обох ніг, неможливість самостійно пересуватися.'}, 
        {prob: 1, level: 'критичне', value: 'Втрата всіх кінцівок', description: 'Відсутність всіх кінцівок, повна залежність від сторонньої допомоги.'},
      ]},
      {prob: 5, type: 0, name: 'Грип', stage: [
        {prob: 6, level: 'легке', value: 'Легкий грип', description: 'Легке підвищення температури, слабкість, нежить.'}, 
        {prob: 3, level: 'легке-середнє', value: 'Середній грип', description: 'Висока температура, кашель, головний біль, ломота в тілі.'},
        {prob: 1, level: 'середнє', value: 'Важкий грип', description: 'Сильна лихоманка, ускладнення на дихальну систему.'},
      ]},
      {prob: 3, type: 0, name: 'Цукровий діабет першого типу', stage: [
        {prob: 6, level: 'легке', value: 'Предіабет', description: 'Незначне підвищення рівня цукру в крові, в організмі відбуваються зміни, але симптоми ще не проявляються.'},
        {prob: 3, level: 'середнє', value: 'Стадія помірного діабету', description: 'Регулярні коливання рівня цукру, втрата ваги, погіршення зору, дратівливість, інсулінозалежність.'},
        {prob: 1, level: 'важке', value: 'Важкий цукровий діабет', description: 'Виражена втома, постійна спрага, хронічна втома, пошкодження нервів, ризик втрати кінцівок, ризик серцевих нападів та інсультів, ослаблений імунітет,  інсулінозалежність.'}
      ]},
      {prob: 3, type: 2, name: 'Цукровий діабет другого типу', stage: [
        {prob: 6, level: 'легке', value: 'Предіабет', description: 'Незначне підвищення рівня цукру в крові, в організмі відбуваються зміни, але симптоми ще не проявляються.'},
        {prob: 3, level: 'середнє', value: 'Стадія помірного діабету', description: 'Регулярні коливання рівня цукру, втрата ваги, погіршення зору, підвищення артеріального тиску, потреба в дієті.'},
        {prob: 1, level: 'важке', value: 'Важкий цукровий діабет', description: 'Виражена втома, значна втрата ваги, постійна спрага, хронічна втома, пошкодження нервів, ризик втрати кінцівок, ризик серцевих нападів та інсультів.'}
      ]},
      {prob: 3, type: 2, name: 'Гіпертонія', stage: [
        {prob: 6, level: 'легке', value: 'Початкова гіпертонія', description: 'Підвищений артеріальний тиск, потребує активного способу життя.'},
        {prob: 3, level: 'легке-середнє', value: 'Середня гіпертонія', description: 'Значне підвищення тиску, регулярне медикаментозне лікування.'},
        {prob: 1, level: 'середнє-важке', value: 'Гіпертонічний криз', description: 'Різке підвищення артеріального тиску, загроза інсульту або інфаркту.'},
      ]},
      {prob: 3, type: 0, name: 'Астма', stage: [
        {prob: 6, level: 'легке', value: 'Легка астма', description: 'Іноді виникають труднощі з диханням, при контакті з алергенами.'},
        {prob: 3, level: 'середнє', value: 'Середня астма', description: 'Часті напади дихальної недостатності, регулярне лікування.'},
        {prob: 1, level: 'середнє-важке', value: 'Важка астма', description: 'Постійна необхідність використання інгаляторів та медикаментів, ускладнення.'},
      ]},
      {prob: 3, type: 1, name: 'Мігрень', stage: [
        {prob: 6, level: 'легке', value: 'Легка мігрень', description: 'Слабкий головний біль, який зникає через декілька годин.'},
        {prob: 3, level: 'легке-середнє', value: 'Середня мігрень', description: 'Сильний головний біль з нудотою та світлочутливістю.'},
        {prob: 1, level: 'середнє-важке', value: 'Важка мігрень', description: 'Необхідність постільного режиму через інтенсивний біль, ускладнення у вигляді зору або координації.'},
      ]},
      {prob: 4, type: 1, name: 'Ожиріння', stage: [
        {prob: 6, level: 'легке', value: 'Надмірна вага', description: 'Невелике перевищення нормальної ваги тіла.'},
        {prob: 3, level: 'легке-середнє', value: 'Ожиріння першого ступеню', description: 'Вага перевищує норму на 30% або більше, потребує дієти та фізичних вправ.'},
        {prob: 1, level: 'середнє', value: 'Ожиріння другого ступеню', description: 'Вага значно перевищує норму, є ризик серцево-судинних захворювань.'},
      ]},
      {prob: 5, type: 0, name: 'Ангіна', stage: [
        {prob: 6, level: 'легке', value: 'Легка ангіна', description: 'Невелике запалення горла, помірний біль при ковтанні.'},
        {prob: 3, level: 'легке-середнє', value: 'Гнійна ангіна', description: 'Запалення мигдалин з утворенням гнійних відкладень, висока температура.'},
        {prob: 1, level: 'середнє', value: 'Флегмонозна ангіна', description: 'Гнійне запалення піднебінних мигдалин, потребує хірургічного втручання.'},
      ]},
      {prob: 5, type: 0, name: 'Бронхіт', stage: [
        {prob: 6, level: 'легке', value: 'Гострий бронхіт', description: 'Короткочасне запалення бронхів, зазвичай спричинене вірусною інфекцією.'},
        {prob: 3, level: 'легке-середнє', value: 'Хронічний бронхіт', description: 'Тривале запалення бронхів, часто пов\'язане з курінням.'},
        {prob: 1, level: 'середнє', value: 'Хронічний бронхіт зі стенозом', description: 'Значне звуження бронхів, ускладнення дихальної функції.'},
      ]},
      {prob: 3, type: 2, name: 'Гастрит', stage: [
        {prob: 6, level: 'легке-середнє', value: 'Ерозивний гастрит', description: 'Запалення слизової оболонки шлунка з ерозіями.'},
        {prob: 3, level: 'середнє', value: 'Атрофічний гастрит', description: 'Зменшення кількості клітин слизової оболонки шлунка.'},
        {prob: 1, level: 'важке', value: 'Гастрит з ускладненнями', description: 'Розвиток виразок або кровотечі внаслідок гастриту.'},
      ]},
      {prob: 2, type: 3, name: 'Інсульт', stage: [
        {prob: 7, level: 'середнє-важке', value: 'Ішемічний інсульт', description: 'Порушення кровопостачання мозку через закупорку артерії, можливі неврологічні дефіцити.'},
        {prob: 3, level: 'критичне', value: 'Геморагічний інсульт', description: 'Крововилив у мозок, високий ризик смерті або серйозних наслідків.'},
      ]},
      {prob: 2, type: 2, name: 'Інфаркт міокарда', stage: [
        {prob: 6, level: 'легке-середнє', value: 'Невеликий інфаркт', description: 'Пошкодження серцевого м\'яза, швидке одужання.'},
        {prob: 3, level: 'середнє-важке', value: 'Помірний інфаркт', description: 'Значне пошкодження серцевого м\'яза, можливе лікування хірургічними методами.'},
        {prob: 1, level: 'критичне', value: 'Важкий інфаркт', description: 'Велике пошкодження серця, високий ризик летального випадку.'},
      ]},
      {prob: 3, type: 3, name: 'Остеопороз', stage: [
        {prob: 6, level: 'легке-середнє', value: 'Початковий остеопороз', description: 'Невелике зниження щільності кісткової тканини.'},
        {prob: 3, level: 'середнє-важке', value: 'Середній остеопороз', description: 'Помітне зменшення щільності кісток, ризик переломів.'},
        {prob: 1, level: 'важке-критичне', value: 'Важкий остеопороз', description: 'Сильне ослаблення кісток, висока ймовірність переломів навіть при мінімальних навантаженнях.'},
      ]},
      {prob: 3, type: 2, name: 'Артрит', stage: [
        {prob: 6, level: 'легке-середнє', value: 'Ревматоїдний артрит', description: 'Запалення суглобів з болем та скутістю.'},
        {prob: 3, level: 'середнє-важке', value: 'Остеоартрит', description: 'Зношення хрящової тканини суглобів; біль в районі суглобів.'},
        {prob: 1, level: 'важке', value: 'Псоріатичний артрит', description: 'Запалення суглобів у поєднанні з псоріазом шкіри(захворювання, при якому на шкірі з\'являються червоні плями, покриті сріблястими лусочками).'},
      ]},
      {prob: 4, type: 1, name: 'Цистит', stage: [
        {prob: 7, level: 'легке-середнє', value: 'Хронічний цистит', description: 'Тривале запалення сечового міхура, постійний дискомфорт.'},
        {prob: 3, level: 'середнє', value: 'Ускладнений цистит', description: 'Запалення поширюється на нирки, можливі системні інфекції.'},
      ]},
      { prob: 3, type: 0, name: 'Апендицит', stage: [
        {prob: 7, level: 'легке-середнє', value: 'Прогресуючий апендицит', description: 'Посилення болю, підвищення температури, ризик перфорації (утворення отвору або дірки в тканинах).'},
        {prob: 3, level: 'середнє', value: 'Ускладнений апендицит', description: 'Перфорація апендикса, перитоніт (запалення оболонки органів в черевній порожнині), потреба в терміновій хірургічній операції.'},
      ]},
      {prob: 2, type: 3, name: 'Хвороба Альцгеймера', stage: [
        {prob: 6, level: 'легке-середнє', value: 'Рання стадія', description: 'Легкі порушення пам\'яті, проблеми з концентрацією.'},
        {prob: 3, level: 'важке', value: 'Середня стадія', description: 'Значні порушення пам\'яті, труднощі в повсякденних справах.'},
        {prob: 1, level: 'важке-критичне', value: 'Пізня стадія', description: 'Втрата здатності до самостійного життя, потреба в постійній догляді.'},
      ]},
      {prob: 3, type: 2, name: 'Розсіяний склероз', stage: [
        {prob: 6, level: 'легке', value: 'Рецидивуюча ремітуюча форма', description: 'Погіршення зору, слабкість у м\'язах, оніміння, порушення координації та рівноваги, які чергуються з періодами часткового або повного покращення.'},
        {prob: 3, level: 'легке-середнє', value: 'Прогресуюча форма', description: 'Постійне погіршення зору, слабкість у м\'язах, оніміння, порушення координації та рівноваги без покращення стану.'},
        {prob: 1, level: 'середнє', value: 'Прогресуюча з рецидивами форма', description: 'Комбінація періодичних критичних загострень та постійного погіршення зору, слабкість у м\'язах, оніміння, порушення координації та рівноваги.'},
      ]},
      {prob: 3, type: 3, name: 'Хвороба Паркінсона', stage: [
        {prob: 6, level: 'легке', value: 'Рання стадія', description: 'Тремтіння, м\'язова ригідність (підвищений тонус м\'язів, при якому вони стають жорсткими і напруженими), повільність рухів.'},
        {prob: 3, level: 'легке-середнє', value: 'Середня стадія', description: 'Збільшення тремтіння, м\'язова ригідність (підвищений тонус м\'язів, при якому вони стають жорсткими і напруженими), повільність рухів, ускладнення координації та рівноваги.'},
        {prob: 1, level: 'середнє-важке', value: 'Пізня стадія', description: 'Сильні порушення рухів, тремтіння, потреба в постійному догляді.'},
      ]},
      {prob: 2, type: 0, name: 'Туберкульоз', stage: [
        {prob: 7, level: 'середнє', value: 'Активний туберкульоз легень', description: 'Симптоми включають кашель, біль у грудях, високу температуру.'},
        {prob: 3, level: 'важке-критичне', value: 'Мультісистемний туберкульоз', description: 'Поширення інфекції на інші органи, кашель, лихоманка, біль в грудях, втрата ваги, складне лікування.'},
      ]},
      {prob: 3, type: 1, name: 'Сифіліс', stage: [
        {prob: 6, level: 'легке-середнє', value: 'Перша стадія', description: 'Поява безболісної виразки на місці інфекції, заразний і потенційно небезпечний.'},
        {prob: 3, level: 'середнє-важке', value: 'Друга стадія', description: 'Висип, лихоманка, загальне нездужання, ураження внутрішніх органів і нервової системи.'},
        {prob: 1, level: 'важке', value: 'Третя стадія', description: 'Інфекція рощвивається, можуть уражатися головний мозок, аорта, серце, кістки та суглоби.'},
      ]},
      {prob: 3, type: 1, name: 'Гонорея', stage: [
        {prob: 7, level: 'легке-середнє', value: 'Легка гонорея', description: 'Збільшення виділень, біль при сечовипусканні.'},
        {prob: 3, level: 'важке', value: 'Ускладнена гонорея', description: 'Перитоніт, артрит, безпліддя.'},
      ]},
      {prob: 4, type: 0, name: 'Екзема', stage: [
        {prob: 7, level: 'легке', value: 'Справжня екзема', description: 'Роздратування шкіри від контакту з алергеном або подразником.'},
        {prob: 3, level: 'середнє', value: 'Атопічна екзема', description: 'Хронічне запалення шкіри, сухість, свербіж, ерозії шкіри.'},
      ]},
      {prob: 4, type: -4, name: "Вітряна віспа", stage: [
        {prob: 7, level: "легке", value: "Легка форма", description: "Помірна кількість висипань, температура; лікується самостійно."},
        {prob: 3, level: "середнє", value: "Важка форма", description: "Велика кількість висипань, лихоманка, ураження слизових оболонок; потребує лікарського контролю."},
      ]},
      {prob: 3, type: -4, name: "Краснуха", stage: [
        {prob: 7, level: "легке", value: "Легка форма", description: "Невелика короткочасна висипка, температура, слабкість."},
        {prob: 3, level: "середнє", value: "Важка форма", description: "Серйозні ускладнення, лихоманка, висипка; потребує медичного втручання."}
      ]},
      {prob: 3, type: -3, name: "Кір", stage: [
        {prob: 7, level: "легке", value: "Легка форма", description: "Легка температура, висипання, кашель, нежить."},
        {prob: 3, level: "середнє", value: "Важка форма", description: "Лихоманка, широке висипання, кашель, серйозні ускладнення; потребує лікарської допомоги."},
      ]},
      {prob: 3, type: 1, name: 'Хламідіоз', stage: [
        {prob: 6, level: 'легке', value: 'Асимптомний хламідіоз', description: 'Інфекція без явних симптомів (запалення статевих органів, сечовивідних шляхів, очей та горла).У цій стадії багато пацієнтів не знають про наявність інфекції, проте вона може все ще бути активною та передаватися іншим.'},
        {prob: 3, level: 'середнє', value: 'Симптомний хламідіоз', description: 'Біль при сечовипусканні, виділення з піхви або статевого члена.'},
        {prob: 1, level: 'середнє-важке', value: 'Ускладнений хламідіоз', description: 'Перитоніт, епідидиміт, безпліддя. Запалення тазових органів у жінок або запалення придатка яєчка у чоловіків, що можуть призводити до безпліддя.'},
      ]},
      {prob: 3, type: 3, name: 'Катаракта', stage: [
        {prob: 6, level: 'легке', value: 'Початкова катаракта', description: 'Незначні порушення зору.'},
        {prob: 3, level: 'середнє', value: 'Середня катаракта', description: 'Помітне затемнення кришталика, зір значно погіршується, потреба в корекції зору.'},
        {prob: 1, level: 'важке', value: 'Важка катаракта', description: 'Сильне затемнення кришталика, потреба в його хірургічному видаленні. Пацієнт може бути практично сліпим.'},
      ]},
      {prob: 2, type: 2, name: 'Шизофренія', stage: [
        {prob: 6, level: 'легке', value: 'Рання стадія', description: 'Незначні відхилення в мисленні та поведінці. Часто симптоми не вважаються серйозними.'},
        {prob: 3, level: 'легке-серднє', value: 'Середня стадія', description: 'Серйозні психічні симптоми, галюцинації. Поведінка більш непередбачувана і важка для контролю.'},
        {prob: 1, level: 'важке', value: 'Пізня стадія', description: 'Суцільні порушення мислення та ризикована неконтрольована поведінка, потреба в постійному догляді; хворий не здатен самостійно функціонувати в суспільстві.'},
      ]},
      {prob: 2, type: -4, name: "Синдром хронічної втоми", stage: [
        {prob: 6, level: "легке", value: "Легкий синдром хронічної втоми", description: 'Періодична втома у стресових ситуаціях або після фізичних навантажень.'},
        {prob: 3, level: "середнє", value: "Середній синдром хронічної втоми", description: 'Постійна втома, проблеми зі сном (безсоння або нічні пробудження).'},
        {prob: 1, level: "важке", value: "Важкий синдром хронічної втоми", description: 'Серйозна втома, значні труднощі з виконанням звичайних завдань, потреба в медичному лікуванні або психологічна підтримка.'},
      ]},
      {prob: 3, type: 0, name: 'Анемія', stage: [
        {prob: 6, level: 'легке', value: 'Легка анемія', description: 'Невелике зниження рівня гемоглобіну, легка втома та слабкість, легка задишка під час фізичної активності.'},
        {prob: 3, level: 'легке-середнє', value: 'Середня анемія', description: 'Помітне зниження гемоглобіну, відчуття сильної втоми, головний біль, запаморочення, підвищена задишка та серцебиття '},
        {prob: 1, level: 'важке', value: 'Важка анемія', description: ' Сильне зниження гемоглобіну, постійна втома, сильні головні болі, порушення концентрації уваги та пам\'яті, потреба в переливанні крові.'},
      ]},
      {prob: 1, type: 0, name: 'ВІЛ', stage: [
        {prob: 4, level: 'легке-середнє', value: 'Початкова (гостра) стадія ВІЛ', description: 'Початкова інфекція, сильна лихоманка, головний біль, ломота в м\'язах і суглобах.'},
        {prob: 3, level: 'середнє', value: 'Безсимптомна стадія', description: 'Відсутність симптом, поступове послаблення імунітету'},
        {prob: 2, level: 'середнє-важке', value: 'Стадія ранніх клінічних проявів ВІЛ-інфекції', description: 'Активна стадія ВІЛ, зниження імунітету, ризик опортуністичних інфекцій, тривала діарея, втрата ваги, постійна втома.'},
        {prob: 1, level: 'важке-критичне', value: 'Стадія синдрому набутого імунодефіциту (СНІД)', description: 'Відсутність імунної відповіді, сильна втрата ваги, значна слабкість та втома, висока ймовірність смерті через опортуністичні інфекції .'},
      ]},
      {prob: 2, type: 0, name: "Депресія", stage: [
        {prob: 6, level: 'легке', value: 'Легка депресія', description: 'Погіршення настрою, втома, відсутність інтересу до звичних справ.'},
        {prob: 3, level: 'середнє', value: 'Стадія помірної депресії', description: 'Постійний пригнічений настрій, порушення сну, дратівливість, проблеми у соціальних взаємодіях.'},
        {prob: 1, level: 'важке', value: 'Важка депресія', description: 'Втрата інтересу до життя, постійна втома, суїцидальні думки, складно виконувати щоденні справи.'}
      ]},
      {prob: 3, type: 0,name: "Цинга", stage: [
        {prob: 6, level: "легке", value: "Початкова цинга",  description: "Слабкість, стомлюваність, дратівливість, легкі болі в м\'язах і суглобах."},
        {prob: 3, level: "легке-середнє", value: "Середня цинга", description: "Кровоточивість ясен, набряки, синці на шкірі, біль у суглобах."},
        {prob: 1, level: "середнє-важке", value: "Важка цинга", description: "Відкриті рани, випадання зубів, сильні болі у м'язах і суглобах."}
      ]},
      {prob: 2, type: 0, name: "Правець", stage: [
        {prob: 6, level: "легке", value: "Початкова стадія правця", description: "Напруження м'язів обличчя, тризм, дискомфорт у м'язах шиї."},
        {prob: 3, level: "середнє", value: "Генералізований правець", description: "Генералізовані м'язові спазми, ригідність м'язів спини та живота, проблеми з диханням."},
        {prob: 1, level: "важке", value: "Важка стадія правця", description: "Інтенсивні спазми м'язів, задуха, порушення серцевого ритму, потреба в інтенсивній терапії."}
      ]},
      {prob: 3, type: 0, name: "Лишай",
        // шлях передачі хвороби diseaseTransmission: "Контактний",
      stage: [
        {prob: 1, level: "легке-середнє", value: "Лишай", description: "Поява червоних або рожевих плям на шкірі, які можуть викликати свербіж або лущення. Відчуття печіння, дискомфорт, подразнення."}
      ]},
      {prob: 4, type: 0, name: "Сезонна алергія",
        // шлях передачі хвороби diseaseTransmission: "Не передається",
      stage: [
        {prob: 1, level: "легке-середнє", value: "Сезонна алергія", description: "Закладеність носа, часте чхання, сльозотеча, свербіж у очах, відчуття втоми, головний біль і незначне підвищення температури."}
      ]},
      {prob: 2, type: 0, name: "Рак легенів", stage: [
        {prob: 6, level: "легке-середнє", value: "Рання стадія", description: "Пухлина обмежена легенями, мінімальне поширення до лімфатичних вузлів."},
        {prob: 3, level: "середнє-важке", value: "Середня стадія", description: "Пухлина збільшилася, можливе поширення на сусідні структури або лімфатичні вузли."},
        {prob: 1, level: "важке", value: "Пізня стадія", description: "Метастази до віддалених органів, таких як мозок, кістки або печінка."}
      ]},
      {prob: 2, type: 0, name: "Рак шкіри (Меланома)", stage: [
        {prob: 6, level: "легке-середнє", value: "Рання стадія", description: "Невелика меланома обмежена поверхнею шкіри, без поширення."},
        {prob: 3, level: "середнє-важке", value: "Середня стадія", description: "Меланома збільшилася в розмірах і може поширюватися на близькі тканини або лімфатичні вузли."},
        {prob: 1, level: "важке", value: "Пізня стадія", description: "Метастазування до віддалених органів, таких як легені, печінка або мозок."}
      ]},
      {prob: 2, type: 0, name: "Лейкемія", stage: [
        {prob: 6, level: "легке", value: "Рання стадія", description: "Початковий вплив на кровотворні клітини з невеликим зменшенням кількості здорових клітин."},
        {prob: 3, level: "середнє", value: "Середня стадія", description: "Значне зменшення кількості здорових клітин крові, перші симптоми анемії та інфекцій."},
        {prob: 1, level: "важке", value: "Пізня стадія", description: "Поширені зміни у складі крові, що потребують негайного лікування."}
      ]},
      {prob: 3, type: 0, name: "Сколіоз", stage: [
        {prob: 4, level: "легке", value: "Перша стадія", description: "Візуально незначне викривлення хребта."},
        {prob: 3, level: "легке-середнє", value: "Друга стадія", description: "Помітне викривлення хребта, асиметрія в талії або плечах. "},
        {prob: 2, level: "середнє-важке", value: "Третя стадія", description: "Викривлення хребта сильно помітне, можливі проблеми з диханням та роботою внутрішніх органів."},
        {prob: 1, level: "важке", value: "Третя стадія", description: "Критичне викревлення хребта, призводити до серйозних проблем зі здоров'ям, таких як порушення функцій серця та легень."},
      ]},
      {prob: 3, type: 0, name: "Клептоманія",
        //diseaseTransmission: "Не передається",
      stage: [
        {prob: 1, level: "легке-середнє", value: "Клептоманія", description: "Поява постійного і непереборного бажання красти предмети, які зазвичай не мають значної матеріальної цінності."}
      ]},
      {prob: 3, type: 1, name: "Лудоманія",
        // diseaseTransmission: "Не передається",
      stage: [
        {prob: 1, level: "легке-середнє", value: "Лудоманія", description: "Часте залучення до азартних ігор з початковим захопленням виграшами. Збудження та сильний потяг до гри, людина прагнене повторити виграшний досвід, навіть якщо програє."}
      ]},
      {prob: 3, type: 1, name: "Наркоманія",
        // diseaseTransmission: "Не передається",
      stage: [
        {prob: 1, level: "середнє-важке", value: "Наркоманія", description: "Постійна потреба в наркотиках, щоб уникнути фізичних і психологічних симптомів, таких як біль, тремтіння, тривога, депресія. Виникають серйозні проблеми зі здоров'ям, включаючи пошкодження внутрішніх органів, порушення нервової системи та психічні розлади."}
      ]},
      {prob: 3, type: 1, name: "Алкоголізм",
        // diseaseTransmission: "Не передається",
      stage: [
        {prob: 1, level: "середнє-важке", value: "Алкоголізм", description: "Критична залежність від алкоголю, з фізичними і психологічними наслідками. Неможливість контролювати споживання алкоголю, регулярне вживання алкоголю у великих кількостях. Виникають психічні розлади, такі як депресія або тривога, можуть розвиватися серйозні медичні ускладнення (цироз печінки, кардіоваскулярні захворювання)."}
      ]},
      {prob: 3, type: 0, name: "Плоскостопія",
      // diseaseTransmission: "Не передається",
      stage: [
        {prob: 6, level: "легке", value: "Плоскостопія", description: "Легка втома в ногах після тривалої ходьби, невеликий дискомфорт у стопах."},
        {prob: 3, level: "середнє", value: "Плоскостопія", description: "Біль у стопах, збільшена втома, помітна деформація стопи, необхідність у використанні спеціального взуття."},
        {prob: 1, level: "середнє-важке", value: "Плоскостопія", description: "Постійний біль у ногах та спині, значна деформація стоп, обмеження рухливості, можливість розвитку ускладнень у суглобах та хребті."}
      ]}, 
      {prob: 4, type: 0, name: "Порушення зору",
      // diseaseTransmission: "Не передається/генетичний" ?,
      stage: [
        {prob: 6, level: "легке", value: "Легке орушення зору", description: "Потреба у носінні окулярів або контактних лінз, зниження здатності бачити на відстані або зблизька."},
        {prob: 3, level: "середнє-важке", value: "Сильне порушення зору", description: "Сильне зниження зору, складність у розрізненні предметів без коригуючих засобів, часткова втрата зору."},
        {prob: 1, level: "важке-критичне", value: "Сліпота", description: "Повна втрата зору, нездатність розрізняти світло та тінь."}
      ]},
      {prob: 4, type: 0, name: "Порушення слуху",
      // diseaseTransmission: "Не передається/генетичний" ?,
      stage: [
        {prob: 6, level: "легке", value: "Легке порушення слуху", description: "Зниження слуху, потреба в підвищенні гучності звуків, труднощі у спілкуванні без допомоги слухових пристроїв."},
        {prob: 3, level: "середнє-важке", value: "Сильне порушення слуху", description: "Значне зниження слуху, складність у сприйнятті більшості звуків, потреба у використанні слухового апарата."},
        {prob: 1, level: "важке-критичне", value: "Глухота", description: "Повна втрата слуху, нездатність сприймати звуки навіть за допомогою пристроїв."}
      ]},
      {prob: 2, type: 0, name: "Синдром Дауна",
        //diseaseTransmission: "Генетичний",
      stage: [
        {prob: 6, level: "середнє", value: "Легка стадія синдрому Дауна", description: "Легкі когнітивні труднощі, збереження можливості навчання, незначні фізичні особливості (наприклад, зниження м’язового тонусу)."},
        {prob: 3, level: "важке", value: "Середня стадія синдрому Дауна", description: "Помірні когнітивні порушення, необхідність у спеціалізованій освіті та підтримці, помітніші фізичні ознаки та вади розвитку (наприклад, проблеми з серцем)."},
        {prob: 1, level: "критичне", value: "Важка стадія синдрому Дауна", description: "Серйозні когнітивні порушення, значна фізична інвалідність, часті медичні ускладнення (серцеві проблеми, порушення зору та слуху)."}
      ]}, 
      {prob: 2, type: 0, name: "Аутизм",
        //diseaseTransmission: "Генетичний?",
      stage: [
        {prob: 6, level: "середнє", value: "Легка стадія аутизму", description: "Помірні порушення соціальної взаємодії та комунікації, потреба у спеціальній освіті та підтримці, обмежені інтереси та повторювані дії."},
        {prob: 3, level: "важке", value: "Середня стадія аутизму", description: "Серйозні труднощі з соціальною взаємодією та комунікацією, значна залежність від підтримки у повсякденному житті, можливі проблеми з сенсорним сприйняттям та поведінкою."},
        {prob: 1, level: "критичне", value: "Важка стадія аутизму", description: "Повна залежність від сторонньої допомоги, значні комунікаційні бар\'єри, нездатність адаптуватися до соціальних ситуацій, необхідність інтенсивної підтримки в усіх сферах життя."}
      ]},
      {prob: 2, type: 0, name: "Синдром Туретта",
        //diseaseTransmission: "Генетичний?",
      stage: [
        {prob: 6, level: "середнє", value: "Легка стадія синдрому Туретта", description: "Часті тіки, які можуть викликати незручності в соціальних ситуаціях, потреба у спеціальній підтримці для керування симптомами."},
        {prob: 3, level: "важке", value: "Середня стадія синдрому Туретта", description: "Інтенсивні, часті тіки, що значно впливають на повсякденне життя, потреба у постійному лікуванні та підтримці."},
        {prob: 1, level: "критичне", value: "Важка стадія синдрому Туретта", description: "Неперервні та важкі тіки, які унеможливлюють нормальне соціальне та професійне життя, потреба у комплексному лікуванні та сторонній допомозі."}
      ]},
      {prob: 1, type: 0, name: "Чума",
      // diseaseTransmission: "Контактний, повітряно-крапельний",
      stage: [
        {prob: 6, level: "середнє", value: "Легка стадія чуми", description: "Сильне запалення лімфатичних вузлів, поява болісних набряків (бубонів), підвищення температури тіла, слабкість і ломота у всьому тілі. Інфекція починає поширюватися на інші органи."},
        {prob: 3, level: "важке", value: "Середня стадія чуми", description: "Розвиток сепсису або пневмонічної форми чуми, сильне підвищення температури, задишка, біль у грудях, кашель з кров’ю. Потребує негайної медичної допомоги, висока ймовірність летального наслідку без лікування."},
        {prob: 1, level: "критичне", value: "Важка стадія чуми", description: "Критичний стан: системний сепсис, відмова внутрішніх органів, розвиток шокового стану. Високий ризик летального наслідку навіть при інтенсивному лікуванні."}
      ]}
          
    ],

    profession: [
      { type: [2, 5], name: 'Лікар' },
      { type: [2, 5], name: 'Астролог' },
      { type: [2, 5], name: 'Екстрасенс' },
      { type: [2, 5], name: 'Екзорцист' },
      { type: [1, 5], name: 'Блогер' },
      { type: [1, 5], name: 'Геймер' },
      { type: [2, 5], name: 'Режисер' },
      { type: [2, 3], name: 'Повія' },
      { type: [2, 5], name: 'Гінеколог' },
      { type: [2, 5], name: 'Репродуктолог' },
      { type: [2, 5], name: 'Онколог' },
      { type: [2, 5], name: 'Лікар-інфекціоніст' },
      { type: [2, 5], name: 'Уролог' },
      { type: [1, 3], name: 'Шахтар' },
      { type: [2, 5], name: 'Інженер' },
      { type: [2, 5], name: 'Архітектор' },
      { type: [1, 5], name: 'Програміст' },
      { type: [1, 5], name: 'Водій' },
      { type: [1, 3], name: 'Менеджер' },
      { type: [2, 5], name: 'Фінансист' },
      { type: [1, 3], name: 'Маркетолог' },
      { type: [2, 5], name: 'Юрист' },
      { type: [2, 5], name: 'Науковець' },
      { type: [2, 5], name: 'Викладач' },
      { type: [1, 3], name: 'Графічний дизайнер' },
      { type: [1, 3], name: 'Секретар' },
      { type: [2, 5], name: 'Флорист' },
      { type: [2, 5], name: 'Підприємець' },
      { type: [1, 5], name: 'Кухар' },
      { type: [2, 5], name: 'Геолог' },
      { type: [1, 3], name: 'Офіс-менеджер' },
      { type: [2, 4], name: 'Пожежник' },
      { type: [2, 5], name: 'Терапевт' },
      { type: [1, 2], name: 'Спеціаліст з медіа' },
      { type: [2, 3], name: "Фахівець з комп'ютерних наук" },
      { type: [2, 5], name: 'Психолог' },
      { type: [2, 5], name: 'Механік' },
      { type: [2, 5], name: 'Фізіотерапевт' },
      { type: [1, 5], name: 'Актор' },
      { type: [2, 4], name: 'Агроном' },
      { type: [1, 2], name: 'Модель' },
      { type: [1, 3], name: 'Косметолог' },
      { type: [1, 5], name: 'Еколог' },
      { type: [1, 3], name: 'Офіціант' },
      { type: [2, 5], name: 'Генетик' },
      { type: [1, 2], name: 'Оператор' },
      { type: [2, 5], name: 'Картограф' },
      { type: [2, 5], name: 'Хірург' },
      { type: [2, 5], name: 'Стоматолог' },
      { type: [1, 3], name: 'Фотограф' },
      { type: [2, 3], name: 'Тренер з фітнесу' },
      { type: [2, 5], name: 'Різьбяр по дереву' },
      { type: [2, 5], name: 'Електрик' },
      { type: [2, 5], name: 'Зварювальник' },
      { type: [1, 3], name: 'Продавець' },
      { type: [2, 5], name: 'Журналіст' },
      { type: [2, 5], name: 'Біолог' },
      { type: [2, 5], name: "Дизайнер інте'єрів" },
      { type: [1, 5], name: 'Перекладач' },
      { type: [1, 2], name: "Кур'єр" },
      { type: [2, 5], name: 'Фізик' },
      { type: [2, 5], name: 'Адвокат' },
      { type: [2, 5], name: 'Логіст' },
      { type: [2, 5], name: 'Політолог' },
      { type: [2, 5], name: 'Ветеринар' },
      { type: [2, 5], name: 'Археолог' },
      { type: [3, 5], name: 'Суддя' },
      { type: [2, 3], name: 'Пілот' },
      { type: [1, 5], name: 'Бібліотекар' },
      { type: [2, 3], name: 'Стиліст' },
      { type: [1, 3], name: 'Звукорежисер' },
      { type: [2, 5], name: 'Акушер' },
      { type: [2, 5], name: 'Математик' },
      { type: [1, 3], name: 'Прибиральник' },
      { type: [3, 5], name: 'Філософ' },
      { type: [2, 5], name: 'Енергетик' },
      { type: [2, 3], name: 'Астроном' },
      { type: [1, 5], name: 'Музикант' },
      { type: [1, 3], name: 'Творець відео' },
      { type: [2, 5], name: 'Технолог' },
      { type: [2, 5], name: 'Слюсар' },
      { type: [2, 5], name: 'Епідеміолог' },
      { type: [2, 5], name: 'Біохімік' },
      { type: [2, 5], name: 'Фармацевт' },
      { type: [1, 3], name: 'Охоронець' },
      { type: [2, 3], name: 'Ріелтор' },
      { type: [2, 4], name: 'Поліцейський' },
      { type: [2, 5], name: 'Мисливствознавець' },
      { type: [1, 5], name: 'Історик' },
      { type: [1, 5], name: 'Бджоляр' },
      { type: [2, 4], name: 'Військовий' },
      { type: [1, 3], name: 'Перукар' },
      { type: [2, 3], name: 'Туристичний агент' },
      { type: [1, 3], name: 'Економіст' },
      { type: [2, 4], name: 'Коваль' },
      { type: [1, 2], name: 'Консультант' },
      { type: [1, 5], name: 'Художник' },
      { type: [2, 3], name: 'Будівельник' },
      { type: [2, 3], name: 'Агент з нерухомості' },
      { type: [3, 5], name: 'Священник' },
    ],

    phobias : [
      { name: "Аблютофобія", description: "Страх купання, прання або чищення, виникає як сильна тривога або паніка при контакті з водою." },
      { name: "Автоматонофобія", description: "Страх ляльок, манекенів, воскових фігур та технічних антропоморфних виробів." },
      { name: "Агірофобія", description: "Страх вулиць, перетинати вулицю, відчуття небезпеки на відкритих вулицях." },
      { name: "Агорафобія", description: "Страх простору, відкритих місць, площ, натовпів людей, ринків, що може обмежити людину до перебування вдома." },
      { name: "Аграфобія", description: "Страх сексуальних домагань, може проявлятись як уникавання близьких контактів." },
      { name: "Аерофобія", description: "Страх польотів на літаках, викликає паніку перед і під час авіаперельотів." },
      { name: "Айхмофобія", description: "Страх гострих предметів, таких як ножі або голки, що призводить до уникнення контакту з ними." },
      { name: "Аквафобія", description: "Страх води, може включати страх плавання або перебування поблизу води." },
      { name: "Акрібофобія", description: "Страх не зрозуміти прочитаний текст, що призводить до тривоги під час читання." },
      { name: "Акрофобія", description: "Страх висоти, що може проявлятись при перебуванні на високих місцях або навіть при їх уявленні." },
      { name: "Акустикофобія", description: "Страх гучних звуків, що може викликати панічні атаки при їх виникненні." },
      { name: "Алгофобія", description: "Страх болю, який може призводити до уникнення ситуацій, де можливий фізичний дискомфорт." },
      { name: "Аллодоксофобія", description: "Страх перед думкою оточуючих, може супроводжуватись тривогою щодо суджень інших." },
      { name: "Аміхофобія", description: "Надмірний страх ушкодження шкіри, наприклад, подряпинами або пораненнями пазурами, може призводити до уникання тварин." },
      { name: "Андрофобія", description: "Страх чоловіків, який може проявлятись у відчуженні або уникненні контактів з чоловічою статтю." },
      { name: "Антропофобія", description: "Страх людей або компанії людей, форма соціальної фобії, яка обмежує соціальні контакти." },
      { name: "Апейрофобія", description: "Страх нескінченності, що може проявлятись у страху перед безмежністю часу або простору." },
      { name: "Апекдиктофобія", description: "Нав'язливий страх апендициту, який може викликати тривогу щодо здоров'я та можливих захворювань." },
      { name: "Арахнофобія", description: "Страх павуків; випадок зоофобії, що може призводити до уникання місць, де можуть бути павуки." },
      { name: "Астрафобія", description: "Страх грому та блискавок, що може викликати паніку під час грозових явищ." },
      { name: "Атихіфобія", description: "Страх зробити помилку або отримати негативну оцінку своїх дій, що може обмежувати діяльність людини." },
      { name: "Аутофобія", description: "Страх самотності, залишатися на самоті, що може призводити до залежності від інших людей." },
      { name: "Аффефобія", description: "Страх дотику оточуючих людей, що може обмежувати фізичні контакти та соціальні взаємодії." },
      { name: "Ахлуофобія", description: "Страх темряви, ночі або перебування у темних місцях, що може викликати тривогу у темний час доби." },
      { name: "Батофобія", description: "Страх глибини, який може проявлятись у страху перед великими глибинами води або отворами." },
      { name: "Беллумофобія", description: "Страх війни, військових дій і всього, що з цим пов'язано, може викликати тривогу під час конфліктів або враження агресії." },
      { name: "Біфобія", description: "Упередження, ненависть чи страх бісексуальних людей, що може призводити до дискримінації та ізоляції." },
      { name: "Вегафобія", description: "Страх або ненависть до веганів та веганок, що може призводити до соціальної напруги." },
      { name: "Венустрофобія", description: "Страх красивих жінок, що може обмежувати соціальні взаємодії та взаємини." },
      { name: "Вермінофобія", description: "Страх бактерій, мікробів, заразитися, що може призводити до надмірної гігієни та уникання контактів." },
      { name: "Вомітофобія", description: "Страх блювання, що може викликати тривогу при появі нудоти або близьких осіб." },
      { name: "Галітофобія", description: "Страх неприємного запаху з рота, що може призводити до соціальної тривоги та уникання близьких контактів." },
      { name: "Гаптофобія", description: "Страх дотику оточуючих людей, що може обмежувати фізичні контакти та соціальні взаємодії." },
      { name: "Гексакосіойгексаконтагексафобія", description: "Страх числа 666, що може викликати тривогу при зустрічі з цим числом." },
      { name: "Геліофобія", description: "Страх сонця або сонячного світла, що може призводити до уникання перебування на відкритому повітрі вдень." },
      { name: "Гелотофобія", description: "Страх стати об'єктом жартів або насмішок, що може обмежувати соціальні взаємодії." },
      { name: "Гемофобія", description: "Страх крові, що може викликати панічні атаки при її появі або навіть при її згадці." },
      { name: "Генофобія", description: "Страх сексу або сексуальних контактів, що може обмежувати інтимні стосунки." },
      { name: "Геронтофобія", description: "Страх або ненависть до літніх людей або до власного старіння, що може призводити до соціальної ізоляції." },
      { name: "Герпетофобія", description: "Страх рептилій, плазунів, змій; окремий підтип зоофобії." },
      { name: "Гетерофобія", description: "Страх протилежної статі, що може обмежувати міжособистісні взаємодії." },
      { name: "Гефірофобія", description: "Страх мостів, що може призводити до уникання подорожей або переміщення через мости." },
      { name: "Гілофобія", description: "Страх лісу або заблукати в лісі, що може обмежувати перебування на природі." },
      { name: "Гімнофобія", description: "Страх оголеності або вигляду оголених частин тіла, що може призводити до уникання ситуацій, де потрібно бути голим." },
      { name: "Гінекофобія", description: "Страх жінок, що може обмежувати міжособистісні взаємодії з жіночою статтю." },
      { name: "Гіпенгіофобія", description: "Страх взяти на себе відповідальність, часто виникає у чоловіків, коли партнерка завагітніла." },
      { name: "Гіппопотомонстросескіпедалофобія", description: "Страх перед складними або довгими словами, наприклад, назва села Лланвайрпуллґвінгіллґоґерихвирндробуллллантісіліоґоґоґох." },
      { name: "Гіппофобія", description: "Страх коней; випадок зоофобії, який може призводити до уникання контактів із цими тваринами." },
      { name: "Глоссофобія", description: "Страх публічного виступу, що може обмежувати виступи перед аудиторією." },
      { name: "Гнозіофобія", description: "Страх знання або пізнання, що може обмежувати бажання вчитися або досліджувати нову інформацію." },
      { name: "Гомофобія", description: "Упереджена неприязнь чи ненависть до людей гомосексуальної орієнтації, що може призводити до дискримінації та соціальної ізоляції." },
      { name: "Гоплофобія", description: "Страх зброї, що може викликати тривогу при зустрічі з будь-якими видами зброї." },
      { name: "Гравідофобія", description: "Страх зустрічі з вагітною особою або вагітності, що може призводити до уникання соціальних контактів з вагітними." },
      { name: "Демофобія", description: "Страх скупчення людей, натовпу, що може обмежувати участь у соціальних подіях та місцях з великим скупченням людей." },
      { name: "Дентофобія", description: "Страх стоматологів, лікування зубів, підтип ятрофобії, що може призводити до уникання стоматологічних візитів." },
      { name: "Децидофобія", description: "Страх приймати рішення, що може призводити до уникання відповідальності та затримок у діяльності." },
      { name: "Дисморфофобія", description: "Страх, несприйняття чи ненависть до власної зовнішності, вигляду тіла, що може призводити до надмірної самокритики та соціальної ізоляції." },
      { name: "Ейсоптрофобія", description: "Страх власного відображення в дзеркалі, що може призводити до уникання дзеркал та інших відображень." },
      { name: "Еметофобія", description: "Страх блювання, що може викликати тривогу при появі нудоти." },
      { name: "Ергофобія", description: "Страх працювати або здійснювати які-небудь дії, що може призводити до уникання професійної діяльності." },
      { name: "Еротофобія", description: "Страх сексу або питань про секс, що може обмежувати інтимні стосунки та сексуальну активність." },
      { name: "Ерофобія", description: "Страх розмов про секс або перед інтимними подіями, що може обмежувати комунікацію в стосунках." },
      { name: "Ефебіфобія", description: "Страх підлітків, що може призводити до уникання контактів з молодшими людьми." },
      { name: "Зоофобія", description: "Страх тварин, що може призводити до уникання контактів з різними видами тварин." },
      { name: "Інсектофобія", description: "Страх комах; випадок зоофобії, що може призводити до уникання контактів з комахами." },
      { name: "Інтернетофобія", description: "Страх використання Інтернету або перебування в онлайн-середовищі, що може обмежувати доступ до інформації та соціальних мереж." },
      { name: "Канцерофобія", description: "Нав'язливий страх захворіти на рак, що може викликати постійну тривогу щодо здоров'я." },
      { name: "Кінофобія", description: "Страх собак; випадок зоофобії, що може призводити до уникання контактів з цими тваринами." },
      { name: "Клаустрофобія", description: "Страх замкнутого простору, що може викликати тривогу у ліфтах, тунелях або інших обмежених місцях." },
      { name: "Клептофобія", description: "Страх вкрасти або бути обкраденими, що може призводити до тривоги щодо безпеки власних речей." },
      { name: "Клімакофобія", description: "Страх ходьби сходами або сходів, що може обмежувати мобільність у багатоповерхових будівлях." },
      { name: "Копрофобія", description: "Страх фекалій, що може призводити до уникання ситуацій, де можуть бути екскременти." },
      { name: "Коулрофобія", description: "Страх клоунів, що може викликати тривогу при зустрічі з клоунами або їхнім зображенням." },
      { name: "Лесбофобія", description: "Упередження, неприязнь чи ненависть до лесбійок та лесбійства, що може призводити до дискримінації та соціальної ізоляції." },
      { name: "Лісофобія", description: "Нав'язливий страх захворіти на сказ, що може викликати тривогу щодо контактів із тваринами." },
      { name: "Логофобія", description: "Страх говорити публічно або з незнайомими людьми, що може обмежувати комунікацію та професійні можливості." },
      { name: "Мегалофобія", description: "Страх великих предметів, будівель, споруд, що може призводити до тривоги у присутності великих об'єктів." },
      { name: "Мізофобія", description: "Страх заразитися інфекційним захворюванням, бруду, дотику до навколишніх предметів, що може призводити до надмірної гігієни та уникання контактів." },
      { name: "Мусофобія", description: "Страх мишей, пацюків; випадок зоофобії, що може призводити до уникання контактів з цими тваринами." },
      { name: "Некрофобія", description: "Страх трупів та похоронних засобів, що може призводити до тривоги у присутності мертвих тіл або під час похоронних церемоній." },
      { name: "Неофобія", description: "Страх нового або змін, що може обмежувати адаптацію до нових ситуацій або середовищ." },
      { name: "Ніктофобія", description: "Страх темряви, ночі або перебування у темних місцях, що може викликати тривогу у темний час доби." },
      { name: "Номофобія", description: "Страх залишитися без мобільного телефону або без зв'язку, що може викликати тривогу при відсутності мобільного пристрою." },
      { name: "Нозофобія", description: "Страх захворіти, що може призводити до постійної тривоги щодо здоров'я та уникання контактів." },
      { name: "Нозокомефобія", description: "Страх лікарень, що може викликати тривогу при необхідності звернення до медичних установ." },
      { name: "Нудофобія", description: "Патологічний страх оголеності, що може призводити до тривоги у ситуаціях, де потрібно бути оголеним." },
      { name: "Осмофобія", description: "Страх тілесних запахів, що може призводити до тривоги у ситуаціях, де присутні неприємні запахи." },
      { name: "Офідіофобія", description: "Страх змій; окремий випадок герпетофобії, що може призводити до уникання контактів із зміями." },
      { name: "Панфобія", description: "Страх всього або постійний страх з невідомої причини, що може призводити до загальної тривожності." },
      { name: "Парурез", description: "Страх сечовипускання на людях, що може призводити до утримання сечі та дискомфорту." },
      { name: "Параскаведекатріафобія", description: "Страх календарного збігу п'ятниці 11-го, що може викликати тривогу у дні, коли ця дата спадає." },
      { name: "Педофобія", description: "Будь-який нав'язливий страх дітей або виробів, що їх імітують, що може призводити до тривоги у присутності дітей." },
      { name: "Пеніафобія", description: "Страх бідності, зубожіння, бідних, що може призводити до тривоги щодо фінансової стабільності." },
      { name: "Пірофобія", description: "Страх вогню, пожеж або загибелі від вогню, що може призводити до тривоги у присутності вогняних елементів." },
      { name: "Продітіофобія", description: "Страх бути зрадженими, що може призводити до тривоги у міжособистісних стосунках." },
      { name: "Радіофобія", description: "Страх радіації, що може викликати тривогу щодо джерел радіаційного випромінювання." },
      { name: "Сейсмофобія", description: "Страх землетрусів, що може викликати тривогу у зонах, схильних до сейсмічної активності." },
      { name: "Синкопофобія", description: "Страх знепритомніти, що може призводити до тривоги у ситуаціях, де є ризик втрати свідомості." },
      { name: "Скопофобія", description: "Страх пильного розглядання іншими, що може викликати тривогу у ситуаціях, де люди можуть звертати на себе увагу." },
      { name: "Сомніфобія", description: "Страх спати, що може призводити до безсоння або інших порушень сну." },
      { name: "Соціофобія", description: "Страх суспільства, контактів, оцінки оточуючими, що може обмежувати соціальні взаємодії та професійні можливості." },
      { name: "Субмеханофобія", description: "Страх штучних об'єктів, що частково або повністю знаходяться під водою, що може призводити до тривоги у водних середовищах." },
      { name: "Танатофобія", description: "Страх смерті, що може призводити до постійної тривоги щодо кінцевості життя." },
      { name: "Тафофобія", description: "Нав'язливий страх поховання живцем або похоронів, що може викликати тривогу при згадці про них." },
      { name: "Телефонофобія", description: "Страх телефону або очікування телефонного дзвінка, що може призводити до уникання телефонних розмов." },
      { name: "Тиреопатолофобія", description: "Нав'язливий страх захворювань щитоподібної залози, що може викликати тривогу щодо здоров'я." },
      { name: "Токсикофобія", description: "Страх отруїтися, що може призводити до тривоги щодо споживання їжі або контактів з хімічними речовинами." },
      { name: "Токофобія", description: "Страх перед пологами, часто виправданий, що може призводити до тривоги у вагітних жінок." },
      { name: "Травматофобія", description: "Страх травми, що може призводити до уникання ризикованих ситуацій." },
      { name: "Трипанофобія", description: "Страх голок та уколів, що може призводити до уникання медичних процедур." },
      { name: "Трискайдекафобія", description: "Страх числа 11, що може викликати тривогу у ситуаціях, де це число присутнє." },
      { name: "Уранофобія", description: "Страх дивитися в небо, спостерігати за небесними об'єктами або астрономічними явищами." },
      { name: "Фагофобія", description: "Страх ковтання або вдавитися їжею, що може призводити до тривоги під час їжі." },
      { name: "Фармакофобія", description: "Страх лікуватися або приймати ліки, що може призводити до уникання медичних процедур та ліків." },
      { name: "Філофобія", description: "Страх закохатися, що може обмежувати здатність встановлювати романтичні стосунки." },
      { name: "Хемофобія", description: "Страх хімії, що може призводити до тривоги у ситуаціях, де використовуються хімічні речовини." },
      { name: "Хронофобія", description: "Страх часу, що може призводити до тривоги щодо управління часом або побоювання перед майбутнім." },
      { name: "Ятрофобія", description: "Страх лікарів або лікування в медичних установах, що може призводити до уникання медичної допомоги. "},
    ],

    ability: [ 
      'Злом замків', 'Плавання', 'Альпінізм', 'Паркур', 'Гіпноз', 'Робототехніка', 'Малювання', 'Плавання', 'Гра на гітарі', 'Написання віршів', 'Гра на піаніно', 'Танці', "В'язання", 'Приготування їжі', 'Фотографування', 'Створення відео', 'Створення вебсайтів', 'Організація заходів', 'Технічне креслення', 'Публічні виступи', 'Ремонт техніки', 'Шиття', 'Вивчення іноземних мов', 'Ведення блогу', 'Критичне мислення', 'Догляд за тваринами', 'Вивчення історії', 'Ораторське мистецтво', 'Гра на скрипці', 'Майстрування меблів', 'Плавання на байдарках', 'Кулінарія', 'Садівництво', 'Фехтування', 'Керування часом', 'Гра на барабанах', 'Догляд за рослинами', 'Написання сценаріїв', 'Ведення переговорів', 'Психологічне консультування', 'Волонтерство', 'Піклування про дітей', 'Пошук та аналіз інформації', 'Створення подкастів', 'Написання музики', 'Складання конструкторів (лего, моделі)', 'Навчання інших', 'Гра на флейті', 'Уміння продавати', 'Управління проектами', 'Робота з відеоредакторами', 'Складання та монтаж меблів', 'Дипломатія', 'Бойові мистецтва', 'Програмування', 'Водіння автотранспорту', 'Водіння мототранспорту', 'Використання дронів', 'Проведення наукових досліджень', 'Створення маркетингових кампаній', 'Тренування собак', 'Гра в шахи', 'Робота з графічним дизайном', 'Медіа-планування', 'Організація подорожей', 'Гра в теніс', 'Гра у футбол', 'Організація свят', 'Складання пазлів', 'Розробка ігор', 'Відновлення антикваріату', 'Викладання', 'Обслуговування автомобілів', 'Сноубординг', 'Створення прикрас', 'Паркур', 'Скейтбординг', 'Катання на роликах', 'Випалювання по дереву', 'Вміння вести діалоги', 'Консультування з особистісного розвитку', 'Акторська майстерність', 'Тайм-менеджмент', 'Написання статей', 'Авіамоделювання', 'Ведення особистого щоденника', 'Флористика', 'Самооборона', 'Створення відеоігор', 'Ручне виготовлення паперу', 'Графіті', 'Декорування приміщень', 'Керування човном', 'Менторство', 'Участь в дебатах', 'Створення рекламних кампаній', 'Гра на тромбоні', 'Гра в покер', 'Спортивне тренування', 'Лижний спорт', 'Картинг', 'Перекладацька діяльність', 'Гра на гармоніці', 'Розведення вогню без сірників', 'Очищення води', 'Перша медична допомога', 'Полювання', 'Знання їстівних та отруйних рослин', 'Риболовля примітивними методами', 'Орієнтація на місцевості', 'Створення пасток для тварин', 'Стрільба з лука', 'Виготовлення зброї', 'Будівництво укриття з природних матеріалів', 'Виготовлення одягу та взуття з підручних матеріалів', 'Консервування та зберігання їжі', "Перев'язка ран та лікування травм", 'Виживання в екстремальних погодних умовах', 'Створення саморобного фільтра для води', 'Догляд за худобою', 'Пошук їжі у дикій природі', 'Обмін та торгівля ресурсами', 'Стратегічне планування безпеки', 'Виготовлення примітивних інструментів', 'Сільське господарство', 'Маскування та уникання небезпек', 'Розвідка території', 'Комунікація за допомогою сигналів', 'Виготовлення засобів для самооборони', 'Збір та зберігання насіння', 'Навички ткацтва', 'Лікування природними засобами', 'Ремонт та обслуговування механізмів', 'Створення ферми', 'Виготовлення натурального мила', 'Виготовлення примітивної зброї', 'Використання медичних трав', 'Технології відновлення енергії', 'Знання основи астрономії', 'Організація захисту території', 'Виготовлення шкіряних виробів', 'Проведення військових навчань', 'Робота з металом', 'Виготовлення примітивного одягу', 'Аналіз умов навколишнього середовища', 'Виготовлення їжі з диких рослин', 'Вивчення екології', 'Виготовлення пасток', 'Виробництво натуральних барвників', 'Створення укриття з підручних матеріалів', 'Оцінка ресурсів місцевості', 'Знання основ військової тактики', 'Створення саморобних музичних інструментів', 'Дослідження навколишнього середовища', 'Оцінка якості води', 'Знання основ електрики', 'Знання способів очищення повітря', 'Переховування від небезпек', 'Знання технік самозахисту', 'Ремонт та модернізація техніки', 'Виготовлення саморобних мікросхем', 'Дослідження корисних копалин', 'Знання основ біології', 'Обслуговування комунікаційних засобів', 'Садівництво без грунту', 'Оцінка небезпечних ситуацій', 'Створення саморобних огорож', 'Виготовлення природних очищувачів повітря', 'Виготовлення та використання димових шашок', 'Знання принципів переробки відходів', 'Технології збору дощової води', 'Пошук укриття в природі', 'Виготовлення базових рятувальних засобів', 'Знання принципів колективного виживання', 'Картографування місцевості', 'Обробка та зберігання насіння', 'Основи хірургії', 'Вакцинація', 'Знання з анатомії людини', 'Лікування травм', 'Профілактика інфекцій', 'Техніки реанімації', 'Лікування отруєнь', 'Надання психологічної підтримки', 'Фізична терапія', 'Використання традиційної медицини', 'Вивчення епідемій', 'Виготовлення натуральних ліків', 'Основи гінекологічного обстеження', 'Виховання дітей'
    ],

    knowledge: [
      "Координати продовольчого магазину поблизу бункера", "Місцезнаходження рятувального вертольоту", "Найближчі точки збору дощової води", "Місцезнаходження неробочого авто з бензином", "Найближчі джерела питної води", "Місця з сигналом мобільного зв'язку", "Річка, придатна для риболовлі", "Координати лікарні поблизу бункера", "Координати аптеки поблизу бункера", "Координати роддому поблизу бункера", "Місцезнаходження колодязя з питною водою", "Координати складу з медичним обладнанням", "Склад з паливом для транспортних засобів", "Розташування їстівних рослин", "Місце розташування покинутої лісопилки з дровами", "Координати SOS-сигнальної точки", "Місцезнаходження рибальських снастей", "Координати складу їжі в покинутому супермаркеті", "Місцезнаходження генератора і запасу палива", "Координати складу обмундирування на військовій базі поблизу", "Місцезнаходження запасу міцних мотузок", "Координати складу батарейок", "Координати печери з джерелом води", "Координати туристичного магазину з наметом та ковдрами", "Координати магазину з зимовим одягом", "Координати закинутої ферми", "Місцезнаходження їстівних грибів", "Координати покинутого будинку з запасами їжі та води", "Координати майстерні з запасом інструментів", "Місцезнаходження лікувальних трав", "Поточні погодні умови та очікувані зміни", "Місця для полювання", "Місцеві частоти екстреного зв'язку", "Координати робочого авто", "Координати бункера з двома біохіміками", "Координати бункера з фертильними жінками", "Координати складу з насінням", "Координати складу з саджанцями рослин", "Координати фури з сухариками Flint", "Координати бункера з Джастіном Бібером", "Розташування хатинки з колекцією коміксів", "Місцезнаходження складу старих вінілових платівок", "Координати місця з рибними консервами", "Координати магазину техніки", "Координати загубленого багажа з монополією і чипсами", "Координати покинутого караоке-клубу", "Розташування бункера з колекцією ретро-автомобілів", "Розташування таємної кімнати з домашнім кінотеатром в бункері", "Розташування таємної кімнати з 3D-принтером в бункері", "Координати лавандового поля", "Координати таємного бару з безалкогольними коктейлями", "Місцезнаходження телескопа", "Координати покинутої яхти", "Координати сховища з колекцією фігурок Marvel", "Координати підземного парку з лазертагом", "Координати кафе з ігровими автоматами", "Схований запас продуктів на 2 місяці в бункері", "Координати бібліотеки", "Координати закинутої лабораторії", "Координати полігону зі зброєю", "Координати складу з дисками і VR-іграми", "Місцезнаходження магазину музичних інструментів", "Координати залу для тренувань", "Координати таємної кімнати з настільним футболом в бункері", "Місцезнаходження велосипеда", "Координати ворожо налаштованого бункера", "Координати магазину меблів", "Координати бункера з інжинерами", "Координати радіостанції", "Інформація про небезпечні зони поблизу", "Координати станції очищення води", "Координати воєнної бази", "Координати гідроелектростанцї", "Координати електростанції"
    ],

    behaviour: [
      "Оптиміст", "Песиміст", "Реаліст", "Аналітичний", "Креативний", "Комунікативний", "Сором'язливий", "Ризикований", "Підприємливий", "Лідер", "Сумлінний", "Енергійний", "Справедливий", "Відповідальний", "Спостережливий", "Доброчесний", "Інтроверт", "Екстраверт", "Чуйний", "Терпеливий", "Амбіційний", "Емпатичний", "Екстримал", "Веселий", "Пунктуальний", "Стратег", "Тактик", "Лояльний", "Гнучкий", "Невпевнений", "Спокійний", "Емоційний", "Відкритий", "Наполегливий", "Цілеспрямований", "Обачливий", "Злопам\'ятний", "Розумний", "Невибагливий", "Незалежний", "Загадковий", "Вірний", "Дисциплінований", "Харизматичний", "Приятельський", "Упертий", "Стресостійкий", "Щирий", "Чесний", "Неконфліктний", "Впевнений", "Романтичний", "Саркастичний", "Холоднокровний", "Забобонний", "Наївний", "Цинічний", "Допитливий", "Досвідчений", "Системний", "Чистолюбивий", "Прагматичний", "Завзятий", "Ентузіаст", "Непередбачуваний", "Тривожний", "Керівник", "Відчайдушний", "Ласкавий", "Серйозний", "Спонтанний", "Безтурботний", "Тривожний", "Сентиментальний", "Пацифіст", "Апатичний", "Надійний", "Розважливий", "Патріотичний", "Сучасний", "Ідеаліст", "Еко-френдлі", "Працьовитий", "Скептичний", "Благородний", "Дотепний", "Мудрий", "Конструктивний", "Поміркований", "Гуманний", "Рішучий", "Ліберальний", "Консервативний", "Недовірливий", "Сміливий", "Перфекціоніст", "Толерантний", "Егоїст", "Альтруїст", "Хитрий", "Підступний", "Агресивний", "Вольовий", "Хтивий", "Психопат", "Аскетичий", "Дикий", "Інфантильний", "Високомірний", "Жорстокий"
    ],

    baggage: [ 
      "Лялька", "Сервіз з порцеляни", "Дзеркало для макіяжу", "Книги про подорожі", "Журнали мод", "Альбом для малювання", "Туш для вій", "Лак для нігтів", "Гітара", "Шахова дошка", "Плюшева лама", "Ковдра з дитячим малюнком", "Великі бездротові навушники", "Плакат з Годжо Сатору", "Гамак", "Скрипка", "Політичні листівки з виборів 2019 року", "Календар за 2017 рік", "Декоративні камені", "Подушка у формі серця", "Велика фігурка динозавра", "Книга з анекдотами", "Касета з музикою Queen", "Настільний глобус", "Настінний календар", "Журнал Forbes", "Солом'яний капелюх", "Флакон духів з ароматом квітів", "Скринька з коштовностями", "Фотоальбом з випускного класу", "Листівки з привітаннями на свята", "Повітряні кульки", "Штучні квіти", "Шоколадний заяць", "Вологі і сухі серветки", "Магнітик \"I love Mukachevo\"", "Статуетка Ейфелевої вежі", "Блокнот для заміток", "Вазон", "Водяний пістолет", "Іграшковий робот", "Окуляри і шапочка для басейну", "Лазерна указка", "Гумові рукавички", "Іграшковий пістолет", "Новорічна гірлянда", "Піньята", "Мікрофон", "Гігантська карта світу", "Магічна куля", "Фен", "Карти для гри в покер", "Мультиварка", "Маска для карнавалу", "Флешка", "Модель літака", "Плюшевий крокодил", "Пилисос", "Наклейки \"Рік і Морті\"", "Музична скринька з балериною", "Портативний касетний магнітофон з 90-х", "Тактичні окуляри", "Окуляри для зору", "Талісман на удачу", "Касета з фільмом \"Титанік\"", "Екшн-камера", "Самокат", "Велоспиед", "Супутниковий знімок міста", "Карта зоряного неба", "Світловий меч", "Пластиковий посуд для ляльок", "Пластиковий ніж", "Канцелярський набір", "Пластиковий контейнер з котлетами", "Запасні шнурки", "Закрутки з маринованими огірками", "Карта доріг", "Світловідбиваюча стрічка", "Скотч і ізолента", "Кіт", "Собака", "Моток ниток і спиці", "Калькулятор з тригонометричними функціями", "Брендова сумка", "2 дощовики", "Рожевий рушник з поні", "Губка і рідина для миття посуду", "Гумовий шланг", "Пакети для сміття", "Фітнес браслет", "Розкладний стілець", "Набір для манікюру", "Сумка-холодильник", "4 ліхтарика на батарейках", "Пакет чоловічого одягу", "Термос з какао", "Набір для малювання", "Ручний насос", "Парасоля з принтом кактусів", "Термометр", "Пусте відро", "Тканинна маска", "Портативний зарядний пристрій", "2 пари гумових чобіт", "Термосумка", "Пляшка оливкової олії", "Швабра", "Набір для прання", "Казанок", "Термокружка з пуером", "2 спальних мішки і карімат", "Сокира", "Мачете", "Кукрі", "20-літрова каністра з колою", "Аптечка з медикаментами", "Антисептик і 4 маски", "Мультитул", "Запальничка", "Блок сірників", "3 зимові куртки", "Свічки і канделябр", "Лопата і вила", "Компас", "Мобільний телефон", "Радіоприймач", "Запас їжі на 2 місяці", "Консервовані шпроти", "Фільтр для води", "Каністра з водою", "Каністра з бензином", "Засіб для розпалювання вогню", "Набір для виживання", "Бронежилет", "Протиугарна каска", "Респіратор", "Автомат без патронів", "Рушниця з 10 патронами", "Комплекс вітамінів", "Соковитискач", "Засіб проти комах", "Кава в зернах (арабіка 100%)", "Чай \"Тисяча і одна ніч\"", "Газовий пальник", "Газовий балон на 1 літр", "Грілка", "3 шапки з бомбонами", "3 різні кольорові шкарпетки", "Ланцюг", "Капкан", "Рибальське приладдя", "Обігрівач", "Стетоскоп", "Тонометр (для вимірювання пульсу)", "Медичні бинти", "Медичні маски", "Дефібрилятор", "Антибіотики", "Інсулін", "Інгалятор", "Протигаз", "Вогнегасник", "Таблетки йоду", "Насіння овочів", "Насіння фруктів", "Аспірин", "Лідокаїн", "Портативна газова плита", "Запас дрів на 2 місяці", "5 метрів мотузки", "Суперклей", "Викрутка", "Набір гайкових ключів", "Молоток і цвяхи", "Мона Ліза", "Фарби, пензлі і мольберт", "Ультрафіолетова лампа", "Аінцет і скальпель", "Антибактеріальні серветки", "Анатомічні затиски", "10 шприців з голкою", "Знеболювальні препарати", "Кисневий концентратор з маскою", "Противірусні препарати", "Картон", "Довідник рослин", "4 водонепроникні мішки на 10 літрів", "Засоби для прибирання", "Машинне масло", "Шампунь з запахом шишок", "Гель для душу з ароматом дьогтьового мила", "Крем для обличчя проти висипань", "Гребінець для принцес", "Триммер з насадками", "Зарядка для телефона", "Датчик руху", "Система сигналізації", "Аудіоплеєр і дротові навушники", "Диск з серією \"Том і Джері\"", "Дідове радіо", "Розкладний стіл", "Набір для зварювання", "Старі газети з кросвордами", "5 пачок фольги", "Бутербродниця", "Вудка з котушкою і волосінню", "Спальний матрац", "Шкільні підручники за 7 клас", "Віагра", "Патрони", "Граната ф-1", "Автограф Чарлі Чапліна", "Пачка презервативів", "Скафандр", "Акваланг", "Папуга", "Вагітна вівця", "Надувний човен", "Проносне", "Карти таро", "Гра \"Монополія\"", "Бінокль", "Мікроскоп", "Підзорна труба", "1 мільйон", "Акумулятор для машини", "Динаміт", "Морфін", "Кубинські сигари", "Ключі від машини мільярдера", "Силіконові імпланти", "Пляшка дорогого віскі", "Вібратор", "Костюм покоївки", "Костюм Губки Боба", "Костюм бетмена", "Костюм людини-павука",
    ]  
  },

  envData: {
    country: {
      name: [
        ['Кор', 'Мен', 'Ель', 'Нор', 'Сан', 'Бел', 'Віл', 'Аль', 'Кар', 'Мон', 'Лан', 'Дар', 'Тер', 'Гал', 'Бар', 'Фен', 'Мар', 'Рів', 'Сол'],
        ['ланд', 'ія', 'ова', 'тон', 'стан', 'форд', 'бург', 'вія', 'ган', 'тан', 'лія', 'нія', 'дон', 'вар', 'нія', 'дра', 'дор', 'рія', 'фол', 'мере'],
        ['дор', 'мар', 'ан', 'вен', 'лін', 'зор', 'мір', 'тал', 'він', 'гал', 'лор', 'бер', 'хан', 'рос', 'тін', 'мел', 'нел', 'сал', 'зар', 'рен']
      ],
      quantity: [
        {start: 10, end: 15}
      ],
      population: [
        {start: 1, end: 7}
      ]
    },
    // city: {
    //   name: [
    //     ['Нью', 'Порт', 'Лейк', 'Грін', 'Рівер', 'Вест', 'Іст', 'Норт', 'Саут', 'Форт', 'Клер', 'Спрінг', 'Брайт', 'Феєр', 'Олд', 'Рок', 'Гранд', 'Хай', 'Лоу', 'Санні'],
    //     ['тон', 'вілл', 'бург', 'форд', 'філд', 'в\'ю', 'вуд', 'дейл', 'хейвен', 'сайд', 'брідж', 'ворт', 'гроув', 'хілл', 'бері', 'ленд', 'вей', 'крест', 'веллі']
    //   ],
    //   quantity: [
    //     {start: 5, end: 15}
    //   ],
    //   population: [
    //     {start: 1, end: 7}
    //   ]
    // },
  
    easy: [
      {prob: 4, value: {
        catastrophe: [
          'Торнадо', 'Лісові пожежі', 'Посуха', 'Зсув тектонічних плит'
        ],
        population: [{start: 1, end: 3}],
        vegetation: [{start: 10, end: 25}],
        infrastructure: [{start: 5, end: 15}]
      }},
      {prob: 1, value: {
        catastrophe: [
          'Вірусний спалах', 'Повстання', 'Землетрус'
        ],
        population: [{start: 5, end: 15}],
        vegetation: [{start: 1, end: 3}],
        infrastructure: [{start: 15, end: 35}]
      }}
    ],
    medium: [
      {prob: 4, value: {
        catastrophe: [
          'Хімічний викид', 'Радіаційний витік', 'Пошкодження озонового шару'
        ],
        population: [{start: 5, end: 15}],
        vegetation: [{start: 20, end: 50}],
        infrastructure: [{start: 15, end: 35}]
      }},
      {prob: 1, value: {
        catastrophe: [
          'Нашестя диких тварин'
        ],
        population: [{start: 5, end: 15}],
        vegetation: [{start: 5, end: 15}],
        infrastructure: [{start: 65, end: 85}]
      }}
    ],
    hard: [
      {prob: 4, value: {
        catastrophe: [
          'Виверження вулканів', 'Цунамі', 'Екстремальна спека', 'Екстремальний холод'
        ],
        population: [{start: 55, end: 65}],
        vegetation: [{start: 85, end: 95}],
        infrastructure: [{start: 75, end: 95}]
      }},
      {prob: 1, value: {
        catastrophe: [
          'Вторгнення інопланетян', 'Повстання ШІ'
        ],
        population: [{start: 65, end: 85}],
        vegetation: [{start: 15, end: 45}],
        infrastructure: [{start: 75, end: 95}]
      }}
    ],
    extreme: [
      {prob: 4, value: {
        catastrophe: [
          'Падіння метеорита', 'Ядерна катастрофа'
        ],
        population: [{start: 92, end: 98}],
        vegetation: [{start: 95, end: 100}],
        infrastructure: [{start: 95, end: 100}]
      }},
      {prob: 1, value: {
        catastrophe: [
          'Зомбі-апокаліпсис'
        ],
        population: [{start: 99, end: 100}],
        vegetation: [{start: 55, end: 75}],
        infrastructure: [{start: 65, end: 85}]
      }}
    ],
    difficulty: [
      {start: 5, end: 12, prob: 3, value: 'easy'},
      {start: 12, end: 36, prob: 3, value: 'medium'},
      {start: 36, end: 108, prob: 3, value: 'hard'},
      {start: 108, end: 360, prob: 2, value: 'extreme'}
    ],

    // population: [
    //   {start: 100_000_000, end: 750_000_000}
    // ],
    
    reservs: {
      food:[
        { start: 0, end: 5, prob: 3, },
        { start: 5, end: 12, prob: 6, },
        { start: 12, end: 48, prob: 2, },
        { start: 48, end: 120, prob: 1, },
      ],
      water:[
        { start: 0, end: 5, prob: 3, },
        { start: 5, end: 12, prob: 6, },
        { start: 12, end: 48, prob: 2, },
        { start: 48, end: 120, prob: 1, },
      ],
      gasoline:[
        { start: 0, end: 5, prob: 3, },
        { start: 5, end: 12, prob: 6, },
        { start: 12, end: 48, prob: 2, },
        { start: 48, end: 120, prob: 1, },
      ]
    },
    rooms: {//Додати функціонал ніби якісь люди уже є у бункері
      range:[{start:3,end:6}],
      list:[
        'Медична кімната' ,'Операційна кімната' ,'Кухня' ,'Склад для продуктів' ,'Кімната відпочинку' ,'Спортивний зал' ,'Лабораторія' ,'Зброярня' ,'Кімната для спостереження' ,'Секретний архів' ,'Конференц-зала' ,'Водний резервуар' ,'Майстерня' ,'Радіорубка' ,'Вбиральня' ,'Станція очищення повітря' ,'Станція очищення води' ,'Склад з кисневими балонами' ,'Медичний ізолятор' ,'Серверна кімната' ,'Бібліотека' ,'Сховище з паливом' ,'Оранжерея' ,'Теплиця',
      ]
    },
    medicines: {
      range: [{ start: 1, end: 5 }], // Можна змінити на потрібний діапазон
      list: [
        'Базовий набір ліків', 'Набір антибіотиків', 'Засоби для обробки ран',
        'Препарати для тривалого лікування', 'Операційні інструменти', 'Прототипні ліки',
        'Ліки від радіації', 'Ліки для хіміотерапії', 'Вакцини від базових хвороб',
        'Засоби для знеболення', 'Седативні препарати', 'Бандажі та бинти',
        'Засоби для дезінфекції', 'Медичні маски та рукавички',
        'Препарати для серцево-судинних захворювань', 'Препарати від алергії',
        'Препарати для лікування інфекцій', 'Ліки від отруєнь',
        'Ліки від венерологічних захворювань', 'Запас інсуліну', 'Інгалятор від астми',
      ]
    },
    electricity: {
      range: [{ start: 0, end: 2 }], // Можна змінити на потрібний діапазон
      list: [
        'Батарейний блок', 'Сонячні батареї', 'Ядерний реактор',
        'Вітрогенератори', 'Дизельний генератор', 'Газовий генератор',
        'Паровий генератор', 'Вугільний генератор', 'Вело(педальний) генератор',
        'Водневий генератор', 'Біогазова установка', 'Геотермальна установка',
      ]
    },
    
    // items: {
    //   range: [{ start: 1, end: 5 }], // Можна змінити на потрібний діапазон
    //   list: [
    //     'Газові балони', 'Набір інструментів для ремонту', 'Набір інструментів для садівництва',
    //     'Протигази', 'Набір зброї', 'Набір ліхтарів', 'Радіопередавач',
    //     'Посуд', 'Засоби для очищення води', 'Налобні ліхтарі',
    //   ]
    // }
    
  }
};

module.exports = {data:dataUk}